SetExprField in V8 using mapFields/caseof8/system/mapFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Map data from source patch to target coincident patch
patchMap
(
    //<SourcePatch> <TargetPatch>
    inlet inlet
    outlet outlet
    upperWall upperWall
    lowerWall lowerWall
    frontAndBack frontAndBack
);

// Target patches whose field values are mapped from the internal source mesh
cuttingPatches
(
    //<targetPatch1>
    //<targetPatch2>
);

// ************************************************************************* //
